Tekla.Structures.Dialog.WindowLocalization
Translation logic for translating strings.
Loads default localization file when instantiated

Tekla.Structures.Dialog.WindowLocalization.localization
Localization Handler

Tekla.Structures.Dialog.WindowLocalization.currentCulture
current Culture

Tekla.Structures.Dialog.WindowLocalization.PropertyChanged
Event to refresh User Interface

Tekla.Structures.Dialog.WindowLocalization.Instance
Instantiation

Tekla.Structures.Dialog.WindowLocalization.Item(System.String)
Returns translated string

Tekla.Structures.Dialog.WindowLocalization.CurrentLocalization
Localization

Tekla.Structures.Dialog.WindowLocalization.LoadFile(System.Windows.Controls.Control)
Method to add localization file for fetching translated strings

Tekla.Structures.Dialog.WindowLocalization.LoadFile(System.String)
Method to add localization file for fetching translations

Tekla.Structures.Dialog.WindowLocalization.CurrentCulture
Current culture